<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Creating views 1
© ExploreAI Academy

In this exercise, we learn how to create different types of views and how to drop views. 

Ensure that you have downloaded the database file Chinook.db.

## Learning objectives

By the end of this train, you should be able to:
- Create `LOOKUP`, `JOIN`, and `AGGREGATING` views.
- Drop a view.

First, let's load our sample database:

In [2]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [3]:
# Load the Chinook database stored in your local machine. 
# Make sure the file is saved in the same folder as this notebook.
%sql sqlite:///chinook.db

Here is a [view](https://www.lucidchart.com/pages/er-diagrams) of all of our tables in the database:

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://github.com/Explore-AI/Pictures/blob/master/sqlite-sample-database-color.jpg?raw=true"  style="width:90%";/>
<br>
<br>
    <em>Figure 1: Chinook ERD</em>
</div>

## Exercise

Run the necessary queries that will provide us with the following information. Compare your queries with the solutions at the end of this notebook.

### Exercise 1

Create a `LOOKUP` view of the surname, first name, title, and country of each employee called `Employee_View`.

In [6]:
%%sql

CREATE VIEW
    Employee_view AS
SELECT
    LastName,
    FirstName,
    title,
    country
FROM
    employees;

 * sqlite:///chinook.db
Done.

[]

### Exercise 2


Query the `Employee_View` view to get a view of the sales team.

Use the wildcard operators and the LIKE query to filter all the employees in the specified view.

In [8]:
%%sql

SELECT
    *
FROM
    Employee_view
WHERE
    title LIKE 'IT%';

 * sqlite:///chinook.db
Done.

[('Mitchell', 'Michael', 'IT Manager', 'Canada'),
 ('King', 'Robert', 'IT Staff', 'Canada'),
 ('Callahan', 'Laura', 'IT Staff', 'Canada')]

### Exercise 3


Create a `JOIN` view that will link up all the customers with the support staff assisting them, called `Customer_Support_View`. We want to view the following:

- First name of the customer
- Last name (surname) of the customer
- Country where the customer resides
- SupportRepId
- EmployeeId
- Last name of the employee
- First name of the employee
- Job title of the employee
- Country where the employee operated from

In [24]:
%%sql

CREATE VIEW Customer_Support_View AS
SELECT
    c.FirstName || " " || c.LastName AS CustomerName,
    c.Country AS CustomerCountry,
    c.SupportRepID,
    e.EmployeeID,
    e.FirstName || " " || e.LastName AS EmpolyeeName,
    e.title,
    e.country AS EmployeeCountry
FROM
    customers c
JOIN employees e on e.employeeid = c.SupportRepID

 * sqlite:///chinook.db
Done.

[]

### Exercise 4

Query the `Customer_Support_View` view to get a list of the names and surnames of the clients who were helped by an employee with the `Employeeid` '3'.

In [25]:
%%sql

SELECT
    *
FROM
    Customer_Support_View
WHERE
    employeeid = 3;

 * sqlite:///chinook.db
Done.

[('Luís Gonçalves', 'Brazil', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('François Tremblay', 'Canada', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Roberto Almeida', 'Brazil', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Jennifer Peterson', 'Canada', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Michelle Brooks', 'USA', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Tim Goyer', 'USA', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Frank Ralston', 'USA', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Robert Brown', 'Canada', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Edward Francis', 'Canada', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Ellie Sullivan', 'Canada', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Fynn Zimmermann', 'Germany', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Niklas Schröder', 'Germany', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Wyatt Girard', 'France', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Isabelle Mercier', 'France', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Terhi Hämäläinen', 'Finland', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Ladislav Kovács', 'Hungary', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ("Hugh O'Reilly", 'Ireland', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Emma Jones', 'United Kingdom', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Phil Hughes', 'United Kingdom', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Manoj Pareek', 'India', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada'),
 ('Puja Srivastava', 'India', 3, 3, 'Jane Peacock', 'Sales Support Agent', 'Canada')]

### Exercise 5

Create an `AGGREGATING` view that counts the number of customers that are currently being serviced per country, called `Customer_per_Country_View`.

We would like to see the country name and the number of customers in this view.

In [26]:
%%sql 

CREATE VIEW Customer_per_Country_View AS
SELECT COUNT (CustomerId) AS Num_customers, Country
FROM customers
GROUP BY Country;

 * sqlite:///chinook.db
Done.

[]

### Exercise 6
Write a query that returns the country with the most customers from `Customer_per_Country_View`.

In [30]:
%%sql 

SELECT
    *
FROM
    Customer_per_Country_View
ORDER BY
    num_customers DESC
LIMIT
    5

 * sqlite:///chinook.db
Done.

[(13, 'USA'), (8, 'Canada'), (5, 'Brazil'), (5, 'France'), (4, 'Germany')]

### Exercise 7

Write a query that will delete the `Employee_View` view.

In [31]:
%%sql 
DROP VIEW Employee_View

 * sqlite:///chinook.db
Done.

[]

### Challenge question

Write a query that returns the number of customers that each support employee services, along with the name of the employee. Call this view `Support_Person_Stats`.

To do this, we will need to create a view, join the Customer and Employee tables, and use the `COUNT` and `GROUP BY` functions to aggregate the number of employees serviced by each employee.

In [33]:
%%sql 
SELECT
    *
FROM
    Support_Person_Stats

 * sqlite:///chinook.db
Done.

[(21, 3, 'Peacock'), (20, 4, 'Park'), (18, 5, 'Johnson')]

## Solutions

### Exercise 1

In [ ]:
%%sql

CREATE VIEW Employee_View AS 
SELECT LastName, FirstName, Title, Country
FROM Employees;

### Exercise 2

In [ ]:
%%sql

SELECT * FROM Employee_View
WHERE Title LIKE '%Sales%'

### Exercise 3

In [ ]:
%%sql
CREATE VIEW
    Customer_Support_View AS
SELECT
    c.FirstName Customer_Name,
    c.LastName Customer_Surname,
    c.Country Customer_Country,
    c.SupportRepId,
    e.EmployeeId,
    e.LastName Employee_surname,
    e.FirstName Employee_first_name,
    e.Title Employee_job_title,
    e.Country Employee_Country
FROM
    customers c
    INNER JOIN employees e ON c.SupportRepId = e.EmployeeId

### Exercise 4

In [ ]:
%%sql

SELECT Customer_Name, Customer_Surname 
FROM Customer_Support_View
WHERE Employeeid = 3;

### Exercise 5

In [ ]:
%%sql

CREATE VIEW Customer_per_Country_View AS 
SELECT COUNT (CustomerId) AS Num_customers, Country
FROM customers
GROUP BY Country;

### Exercise 6

In [29]:
%%sql

SELECT Country, MAX(Num_customers) 
FROM Customer_per_Country_View

 * sqlite:///chinook.db
Done.

[('USA', 13)]

### Exercise 7

In [ ]:
%%sql

DROP VIEW Employee_View

### Challenge question

In [32]:
%%sql

CREATE VIEW Support_Person_Stats AS
SELECT COUNT(c.SupportRepId) Count_of_Customers_Serviced , e.EmployeeId, e.LastName
FROM customers c 
INNER JOIN employees e
ON c.SupportRepId = e.EmployeeId
GROUP BY e.EmployeeId;

 * sqlite:///chinook.db
Done.

[]

* Note: Because views are added to the main database after they are created, if we want to perform the `CREATE VIEW` commands again, we must first drop the prior view to prevent receiving a 'VIEW already exists' error.

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>